In [1]:
import numpy as np
import pandas as pd

In [2]:
d = {'Quiz Question ID': ["DATA_TRANSFORM1", "KMEANS2", "DATA_TRANSFORM1", "KMEANS2", "DATA_TRANSFORM1", "KMEANS2", "SPECTRAL3"], 
     'Student Name': ["Geoff Hinton", "Geoff Hinton", "Grace Hopper", "Grace Hopper", "Dennis Hopper", "Dennis Hopper", "Dennis Hopper"],
     'Answer Score': [1, 2, 4, 1, 7, 8, 1], 
     'QTY': [37, 11, 14, 14, 52, 366, 90]}
df = pd.DataFrame(data=d)
df

  Quiz Question ID   Student Name  Answer Score  QTY
0  DATA_TRANSFORM1   Geoff Hinton             1   37
1          KMEANS2   Geoff Hinton             2   11
2  DATA_TRANSFORM1   Grace Hopper             4   14
3          KMEANS2   Grace Hopper             1   14
4  DATA_TRANSFORM1  Dennis Hopper             7   52
5          KMEANS2  Dennis Hopper             8  366
6        SPECTRAL3  Dennis Hopper             1   90

In [3]:
#population mean
#population sd
#z-score

In [4]:
#percent correct for Geoff Hinton
sum(df[df["Student Name"] == "Geoff Hinton"]["Answer Score"]) / len(df[df["Student Name"] == "Geoff Hinton"]) * 100

150.0

In [5]:
len(df['Quiz Question ID'].unique())

3

In [6]:
df['total'] = df['Answer Score'] * df['QTY']

In [7]:
df.sort_values(by=['total'], ascending=False)

  Quiz Question ID   Student Name  Answer Score  QTY  total
5          KMEANS2  Dennis Hopper             8  366   2928
4  DATA_TRANSFORM1  Dennis Hopper             7   52    364
6        SPECTRAL3  Dennis Hopper             1   90     90
2  DATA_TRANSFORM1   Grace Hopper             4   14     56
0  DATA_TRANSFORM1   Geoff Hinton             1   37     37
1          KMEANS2   Geoff Hinton             2   11     22
3          KMEANS2   Grace Hopper             1   14     14

In [8]:
df.sort_values(by=['total'], ascending=False)[:5]

  Quiz Question ID   Student Name  Answer Score  QTY  total
5          KMEANS2  Dennis Hopper             8  366   2928
4  DATA_TRANSFORM1  Dennis Hopper             7   52    364
6        SPECTRAL3  Dennis Hopper             1   90     90
2  DATA_TRANSFORM1   Grace Hopper             4   14     56
0  DATA_TRANSFORM1   Geoff Hinton             1   37     37

In [9]:
# df['total'] = df['UNIT_PRICE'] * df['QTY']; 
# df.sort_values(by=['total'], ascending=False)